app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" ORDER BY "contacts"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "contacts" ORDER BY "contacts"."name" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 15], ["OFFSET", 0]]
---
  def index
    @contacts = Contact.order(:name).page(params[:page]).per(15)

UPDATE "contacts" SET "kind_id" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["kind_id", 1], ["updated_at", "2021-05-31 01:52:08.994069"], ["id", 33]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)